Задание 1

<?php
$a=1;
$b=-5;

if ($a>=0 && $b>=0) {
	echo $a - $b;
} elseif ($a<0 && $b<0) {
	echo $a * $b;
} else {
	echo $a + $b;
} 
?>

Задание 2

<?php
$a=mt_rand(0,15);
switch($a) {
	case 0: echo "0 ";
	case 1: echo "1 ";
	case 2: echo "2 ";
	case 3: echo "3 ";
	case 4: echo "4 ";
	case 5: echo "5 ";
	case 6: echo "6 ";
	case 7: echo "7 ";
	case 8: echo "8 ";
	case 9: echo "9 ";
	case 10: echo "10 ";
	case 11: echo "11 ";
	case 12: echo "12 ";
	case 13: echo "13 ";
	case 14: echo "14 ";
	case 15: echo "15 ";
	break;
}
?>

Задание 3

<?php
$a=mt_rand(0,15);
$b=match($a){
	0 => '0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15',
	1 => '1 2 3 4 5 6 7 8 9 10 11 12 13 14 15',
	2 => '2 3 4 5 6 7 8 9 10 11 12 13 14 15',
	3 => '3 4 5 6 7 8 9 10 11 12 13 14 15',
	4 => '4 5 6 7 8 9 10 11 12 13 14 15',
	5 => '5 6 7 8 9 10 11 12 13 14 15',
	6 => '6 7 8 9 10 11 12 13 14 15',
	7 => '7 8 9 10 11 12 13 14 15',
	8 => '8 9 10 11 12 13 14 15',
	9 => '9 10 11 12 13 14 15',
	10 => '10 11 12 13 14 15',
	11 => '11 12 13 14 15',
	12 => '12 13 14 15',
	13 => '13 14 15',
	14 => '14 15',
	15 => '15',
};

echo $b;