<?php

// через фор вычислил все четные
for ($i = 1; $i <= 100; $i++) {
	if (gettype($i / 2) == 'integer') {
		echo $i . "\n";
	};
};
//через while вычислил все четные
$i = 1;
while ($i <= 100) {
	if (gettype($i / 2) == 'integer') {
		echo $i . "\n";
		$i++;
	} else {
		$i++;
	}
};


//вычисляем через for и while все числа, которые делятся на 3 без остатка

$i2 = 1;
while ($i2 <= 100) {
	if (gettype($i2 / 3) == 'integer') {
		echo $i2 . "\n";
		$i2++;
	} else {
		$i2++;
	}
};


for ($i3 = 1; $i3 <= 100; $i3++) {
	if (gettype($i3 / 3) == 'integer') {
		echo $i3 . "\n";
	};
};

// через do-while делаем вывод четных нечетных чисел и подписываем их

$i = 0;

do {
	if ($i === 0) {
		echo "0 - нуль \n";
		$i++;
	} elseif ((gettype($i / 2) === "integer")) {
		echo $i . " - чет \n";
		$i++;
	} else {
		echo $i . " - нечет \n";
		$i++;
	}
} while ($i <= 10);

//foreach перебрал и вывел города регионов
$map = array(
	'Московская область' => ['Домодедово', 'Бронницы', 'Жуковский', 'Дубна', 'Королев', 'Ивантеевка', 'Звенигород', 'Климовск', 'Реутов', 'Краснознаменск', 'Лыткарино', 'Протвино', 'Пущино', 'Москва'],
	'Ленинградская область' => ['Сосновый Бор', 'Волосово', 'Пикалево', 'Волхов', 'Сясьстрой', 'Сертолово', 'Всеволожск', 'Выборг', 'Каменногорск', 'Светогорск', 'Кингисепп', 'Санкт-Петербург'],
	'Республика Карелия' => ['Костомукша', 'Петрозаводск', 'Сортавала', 'Кемь', 'Кондопога', 'Лахденпохья', 'Беломорск', 'Медвежьегорск', 'Суоярви', 'Питкяранта', 'Сегежа']
);
foreach ($map as $key => $val) {
	echo ("\n" . $key . ': ');
	foreach ($val as $v) {
		echo ($v . ', ');
	}
}

//Вывод чисел от 1 до 10 не используя тело for
for ($i = 1; $i <= 10; print $i . ", ", $i++); {
	//тут пусто	
}

// Транслитерация с русского на английский с подменой символов предполагал под использование в URL
function translit($val)
{
	$converter = array(
		'а' => 'a',    'б' => 'b',    'в' => 'v',    'г' => 'g',    'д' => 'd',
		'е' => 'e',    'ё' => 'e',    'ж' => 'zh',   'з' => 'z',    'и' => 'i',
		'й' => 'y',    'к' => 'k',    'л' => 'l',    'м' => 'm',    'н' => 'n',
		'о' => 'o',    'п' => 'p',    'р' => 'r',    'с' => 's',    'т' => 't',
		'у' => 'u',    'ф' => 'f',    'х' => 'h',    'ц' => 'c',    'ч' => 'ch',
		'ш' => 'sh',   'щ' => 'sch',  'ь' => '',     'ы' => 'y',    'ъ' => '',
		'э' => 'e',    'ю' => 'yu',   'я' => 'ya',

		'А' => 'A',    'Б' => 'B',    'В' => 'V',    'Г' => 'G',    'Д' => 'D',
		'Е' => 'E',    'Ё' => 'E',    'Ж' => 'Zh',   'З' => 'Z',    'И' => 'I',
		'Й' => 'Y',    'К' => 'K',    'Л' => 'L',    'М' => 'M',    'Н' => 'N',
		'О' => 'O',    'П' => 'P',    'Р' => 'R',    'С' => 'S',    'Т' => 'T',
		'У' => 'U',    'Ф' => 'F',    'Х' => 'H',    'Ц' => 'C',    'Ч' => 'Ch',
		'Ш' => 'Sh',   'Щ' => 'Sch',  'Ь' => '',     'Ы' => 'Y',    'Ъ' => '',
		'Э' => 'E',    'Ю' => 'Yu',   'Я' => 'Ya',

		' ' => '_', 	', ' => '_',	'.' => '',	'-' => '-',	'	' => '' //знаки пунктуации и пробелы
	);

	$val = strtr($val, $converter);
	return $val;
}

echo translit('верхняя одежда');

// аналогичная функция заменяет символы на нижнее подчеркивание и возвращает сроку
function convertSim($val)
{
	$convertSim = array(

		' ' => '_', 	',' => '_',	'.' => '',	'-' => '-',	'	' => '' //знаки пунктуации и пробелы
	);

	$val = strtr($val, $convertSim);
	return $val;
}

echo convertSim('верхняя одежда');

// выводим меню пунктов из массивов
?>

<!DOCTYPE html>
<html lang="en">

<head>
	<meta charset="UTF-8">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<title>Document</title>
</head>

<body>
	<header>
		<nav>
			<?php
			$navMenu = array(
				'Верхняя одежда' => ['Куртки', 'Толстовки и худи', 'Ветровки', 'Анораки', 'Спортивные куртки'],
				'Обувь' => ['Кроссовки', 'Ботинки', 'Туфли', 'Кеды'],
				'Аксессуары' => ['Шнурки', 'Резинки', 'Салфетки'],

			);
			foreach ($navMenu as $key => $val) {
				echo ('<ul>');
				echo ($key . ': ');
				foreach ($val as $v) {
					echo ('<li>' . $v . '</li>');
				};
				echo ('</ul>');
			};
			?>
		</nav>
	</header>

</body>

</html>

<?php
//выводим массив города, начинающиеся на букву "К"
$map = array(
	'Московская область' => ['Домодедово', 'Бронницы', 'Жуковский', 'Дубна', 'Королев', 'Ивантеевка', 'Звенигород', 'Климовск', 'Реутов', 'Краснознаменск', 'Лыткарино', 'Протвино', 'Пущино', 'Москва'],
	'Ленинградская область' => ['Сосновый Бор', 'Волосово', 'Пикалево', 'Волхов', 'Сясьстрой', 'Сертолово', 'Всеволожск', 'Выборг', 'Каменногорск', 'Светогорск', 'Кингисепп', 'Санкт-Петербург'],
	'Республика Карелия' => ['Костомукша', 'Петрозаводск', 'Сортавала', 'Кемь', 'Кондопога', 'Лахденпохья', 'Беломорск', 'Медвежьегорск', 'Суоярви', 'Питкяранта', 'Сегежа']
);
foreach ($map as $key => $val) {
	echo ("\n" . $key . ': ');
	foreach ($val as $v) {
		if (mb_substr($v, 0,1) === "К"){
			echo ($v . ', ');
		} 		
	}
}
?>