<?php

$area = [
	'Московская область' => ['Москва', 'Химки', 'Подольск', 'Мытищи', 'Клин'],
	'Ленинградская область' => ['Санкт-Петербург', 'Выборг', 'Всеволожск', 'Сосновый Бор', 'Тихвин'],
	'Рязанская область' => ['Рязань', 'Касимов', 'Кораблино', 'Михайлов', 'Скопин', 'Рыбное', 'Ряжск'],
	'Тамбовская область' => ['Тамбов', 'Мичуринск', 'Моршанск', 'Котовск']
];

foreach ($area as $region => $cities) {
	$cityStartK = [];
	foreach ($cities as $city) {
			if (mb_substr($city, 0, 1) == 'К') {
			$cityStartK[] = $city;
		}
	}
	if($cityStartK !== []){
	echo $region . ': ' . implode(', ', $cityStartK) . PHP_EOL;
	}
}